[
  {
    "id": "2d6cb99e-b16c-801f-82cf-c04146bd5d30",
    "name": "Dyslexic AI",
    "description": "AI to help with just correcting common framing and spelling mistakes often seen in dyslexics writings. The amount of years clever people have spent correct bad to dad and read to weed will be that, measured in years. Surely this can’t be hard to fix, won’t require huge power, prompt will need to be strict, but model won’t need to huge resource. Cool little idea that can definitely be monetised. ",
    "status": "Idea",
    "link": null,
    "date": "2025-12-27",
    "published": true
  },
  {
    "id": "2d5cb99e-b16c-8094-af7f-cc67525ae481",
    "name": "White T-Shirt",
    "description": "There is a real lack of good-quality, affordable white T-shirts available, pretty much worldwide. M&S did a good one under the name “Seamless,” which, of course, is now discontinued. The rest are cheap shit.\nYou can, however, get a batch of, say, 1,000 made in China with great material to your exact specifications but you’d then need to sell roughly 950 T-shirts. There have to be at least 500 other autists who can’t find a replacement for that pre 2020 M&S item. This one’s been on my mind for a while.",
    "status": "Idea",
    "link": null,
    "date": "2025-12-26",
    "published": true
  },
  {
    "id": "2d5cb99e-b16c-8025-9e57-cb3317b30e60",
    "name": "Automated Type Writer Project",
    "description": "Have a feeling, a more physical medium of communication will make a return. ",
    "status": "In Progress",
    "link": null,
    "date": "2025-12-01",
    "published": true
  },
  {
    "id": "2d5cb99e-b16c-80b1-8a28-e91133dd1c5f",
    "name": "Polymarket Bot",
    "description": "Polymarket Ai slop bot, but it works",
    "status": "In Progress",
    "link": null,
    "date": "2025-11-01",
    "published": true
  },
  {
    "id": "2d5cb99e-b16c-80e4-bf7e-f1f1be449093",
    "name": "JustAskAlready",
    "description": "Similar to NoHello, but somehow trying to monetise this via customisable landing page etc. Shit idea",
    "status": "Idea",
    "link": null,
    "date": "2025-08-01",
    "published": true
  },
  {
    "id": "2d5cb99e-b16c-804f-875a-d1b59e0da5f0",
    "name": "Orange Dealer",
    "description": "App that shows you all places that sell freshly squeezed orange juice. Not horrible bottled stuff. User submitted spots, ratings, prices etc",
    "status": "Idea",
    "link": null,
    "date": "2025-08-01",
    "published": true
  },
  {
    "id": "2d5cb99e-b16c-80a3-b956-f7d6b5243ffa",
    "name": "Automated SBAR Generator ",
    "description": "ingested data, anything really. Spits out a formatted SBAR. Also had ability to strip PII before ingestion into AI model. ",
    "status": "Live",
    "link": null,
    "date": "2025-04-02",
    "published": true
  },
  {
    "id": "2d5cb99e-b16c-8016-8e79-f78b3daa8dd0",
    "name": "YourAIVoiceJournal",
    "description": "Biggest miss - didn't market it at all, should have, was good enough to make cash. Web app that allows user to have a conversation with AI, document the conversation, create action item etc that would emailed to X email. Use-case really came down to, i have shit to do at work this morning, how can i take 15 minutes of my drive and save a few hours at work via discussing priorities/ideas/action plan etc with AI. The back and forth of the conversation was actually solid for early 2025. Will do more detailed post on backend etc. ",
    "status": "Live",
    "link": null,
    "date": "2025-01-01",
    "published": true
  },
  {
    "id": "2d5cb99e-b16c-80b3-8900-fbdbcb4472b2",
    "name": "MSSPJobs",
    "description": "Same as SOCobs, but wider market with just MSSP jobs. Reckon there is still a good market there, however it is a boring idea. ",
    "status": "Idea",
    "link": null,
    "date": "2024-03-06",
    "published": true
  },
  {
    "id": "2d5cb99e-b16c-807b-86c9-f9665b56469d",
    "name": "SOCJobs",
    "description": "one of first small side projects, job board for SOC jobs in UK. Meh. ",
    "status": "Dead",
    "link": null,
    "date": "2024-02-28",
    "published": true
  },
  {
    "id": "2d6cb99e-b16c-8040-9e41-c65f03cafca4",
    "name": "Lists",
    "description": "The most basic top/tracking app on planet,  will have collab built k. Thinking family here. Love it when u all using same todo lists and can add todos to each other. Very minimal, will use AI to categorise entries. Ability to input written notes in via a scan(pic) &or AI support (minimal cost that),widget as most of those sucks. All stored/sync local or iCloud storage. This is a one day project, fairly high priority as could change how I track things. Drastically ",
    "status": "Idea",
    "link": null,
    "date": null,
    "published": true
  },
  {
    "id": "2d6cb99e-b16c-8024-9683-f412c3c3ffc1",
    "name": "High Quality Outdoor Weather System ",
    "description": "The ones you buy are shit and expensive and never have the data you want or isn’t easy to export bla blaze. There was this twitter account in Dalgety bay which tweeted the weather in good detail every hour, was very cool. I’m still grafting my dad on this idea, but we could build them together as he is better at parts of it than me and could built it to our exact specifications,, and then in turn do a batch as Christmas presents? And then they would also need to be inter connected? Via like mesh or cellular? Whatever is cheapest? Should  add a speaker a speaker to annoy folk. Anyway, this would be fully DIY or an attempt anyway. Interms of 3d printed parts, cnc’d parts, components bought or created and assembled. I think this is double. Hopefully my dad likes it, he can start shipping these units and retire. (Very raw first pass notes right here)",
    "status": "Idea",
    "link": null,
    "date": null,
    "published": true
  }
]